xSouln/Firmware_Examples/habiband_test.ioc
STM32_WPAN.SERVICE4_CHAR1_LENGTH_CHARACTERISTIC=CHAR_VALUE_LEN_VARIABLE
STM32_WPAN.SERVICE4_CHAR1_LONG_NAME=ECG_POINTS
STM32_WPAN.SERVICE4_CHAR1_PROP_NOTIFY=CHAR_PROP_NOTIFY
STM32_WPAN.SERVICE4_CHAR1_PROP_READ=CHAR_PROP_READ
STM32_WPAN.SERVICE4_CHAR1_SHORT_NAME=ECG_POINTS
STM32_WPAN.SERVICE4_CHAR1_UUID=5C 01
STM32_WPAN.SERVICE4_CHAR1_VALUE_LENGTH=64
STM32_WPAN.SERVICE4_CHAR2_LENGTH_CHARACTERISTIC=CHAR_VALUE_LEN_VARIABLE
STM32_WPAN.SERVICE4_CHAR2_LONG_NAME=PPG_POINTS
STM32_WPAN.SERVICE4_CHAR2_PROP_NOTIFY=CHAR_PROP_NOTIFY
STM32_WPAN.SERVICE4_CHAR2_PROP_READ=CHAR_PROP_READ
STM32_WPAN.SERVICE4_CHAR2_SHORT_NAME=PPG_POINTS
STM32_WPAN.SERVICE4_CHAR2_UUID=5C 02
STM32_WPAN.SERVICE4_CHAR2_VALUE_LENGTH=64
STM32_WPAN.SERVICE4_CHAR3_LENGTH_CHARACTERISTIC=CHAR_VALUE_LEN_VARIABLE
STM32_WPAN.SERVICE4_CHAR3_LONG_NAME=ECG_MODE
STM32_WPAN.SERVICE4_CHAR3_SHORT_NAME=ECG_MODE
STM32_WPAN.SERVICE4_CHAR3_UUID=5C 03
STM32_WPAN.SERVICE4_CHAR3_VALUE_LENGTH=8
STM32_WPAN.SERVICE4_CHAR4_LENGTH_CHARACTERISTIC=CHAR_VALUE_LEN_VARIABLE
STM32_WPAN.SERVICE4_CHAR4_LONG_NAME=EKG_CMD
STM32_WPAN.SERVICE4_CHAR4_PROP_INDICATE=CHAR_PROP_INDICATE
STM32_WPAN.SERVICE4_CHAR4_PROP_WRITE=CHAR_PROP_WRITE
STM32_WPAN.SERVICE4_CHAR4_SHORT_NAME=EKG_CMD
STM32_WPAN.SERVICE4_CHAR4_UUID=5C 04
STM32_WPAN.SERVICE4_LONG_NAME=ECK_SERVICE
STM32_WPAN.SERVICE4_NUMBER_OF_CHARACTERISTICS=4
STM32_WPAN.SERVICE4_SHORT_NAME=ECK_SERVICE
STM32_WPAN.SERVICE4_UUID=5C 00
STM32_WPAN.SERVICE5_CHAR1_LENGTH_CHARACTERISTIC=CHAR_VALUE_LEN_VARIABLE
STM32_WPAN.SERVICE5_CHAR1_LONG_NAME=BOOTLOADER_PORT_RX
STM32_WPAN.SERVICE5_CHAR1_PROP_WRITE=CHAR_PROP_WRITE
STM32_WPAN.SERVICE5_CHAR1_SHORT_NAME=BOOTLOADER_PORT_RX
STM32_WPAN.SERVICE5_CHAR1_UUID=B0 01
STM32_WPAN.SERVICE5_CHAR1_VALUE_LENGTH=200
STM32_WPAN.SERVICE5_CHAR2_LENGTH_CHARACTERISTIC=CHAR_VALUE_LEN_VARIABLE
STM32_WPAN.SERVICE5_CHAR2_LONG_NAME=BOOTLOADER_PORT_TX
STM32_WPAN.SERVICE5_CHAR2_PROP_NOTIFY=CHAR_PROP_NOTIFY
STM32_WPAN.SERVICE5_CHAR2_PROP_READ=CHAR_PROP_READ
STM32_WPAN.SERVICE5_CHAR2_SHORT_NAME=BOOTLOADER_PORT_TX
STM32_WPAN.SERVICE5_CHAR2_UUID=B0 02
STM32_WPAN.SERVICE5_CHAR2_VALUE_LENGTH=200
STM32_WPAN.SERVICE5_CHAR3_LONG_NAME=BOOTLOADER_STATUS
STM32_WPAN.SERVICE5_CHAR3_PROP_NOTIFY=CHAR_PROP_NOTIFY
STM32_WPAN.SERVICE5_CHAR3_PROP_READ=CHAR_PROP_READ
STM32_WPAN.SERVICE5_CHAR3_SHORT_NAME=BOOTLOADER_STATUS
STM32_WPAN.SERVICE5_CHAR3_UUID=B0 03
STM32_WPAN.SERVICE5_CHAR3_VALUE_LENGTH=20
STM32_WPAN.SERVICE5_LONG_NAME=SYSTEM_SERVICE
STM32_WPAN.SERVICE5_NUMBER_OF_CHARACTERISTICS=3
STM32_WPAN.SERVICE5_SHORT_NAME=SYSTEM_SERVICE
STM32_WPAN.SERVICE5_UUID=B0 00
STMicroelectronics.X-CUBE-MEMS1.8.3.0.BoardOoPartJjAccGyr_Checked=false
STMicroelectronics.X-CUBE-MEMS1.8.3.0.SensorsJjSTM32IiMotionAWIiLibrary_Checked=false
STMicroelectronics.X-CUBE-MEMS1.8.3.0.SensorsJjSTM32IiMotionFDIiLibrary_Checked=false
STMicroelectronics.X-CUBE-MEMS1.8.3.0_SwParameter=STM32IiMotionFDIiLibraryCcSensorsJjSTM32IiMotionFDIiLibraryJjCore\:true;BoardOoPartJjAccGyrJjLSM6DSO\:I2C;STM32IiMotionAWIiLibraryCcSensorsJjSTM32IiMotionAWIiLibraryJjCore\:true;
TIM2.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
TIM2.IPParameters=Channel-PWM Generation2 CH2
USART1.BaudRate=115200
USART1.DMADisableonRxErrorParam=ADVFEATURE_DMA_DISABLEONRXERROR
USART1.IPParameters=VirtualMode-Asynchronous,DMADisableonRxErrorParam,OverrunDisableParam,BaudRate
USART1.OverrunDisableParam=ADVFEATURE_OVERRUN_DISABLE
USART1.VirtualMode-Asynchronous=VM_ASYNC
VP_CRC_VS_CRC.Mode=CRC_Activate
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
VP_HSEM_VS_HSEM.Mode=HSEM_Activate
VP_HSEM_VS_HSEM.Signal=HSEM_VS_HSEM
VP_IPCC_VS_IPCC.Mode=IPCC_Activate
VP_IPCC_VS_IPCC.Signal=IPCC_VS_IPCC
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
VP_RTC_VS_RTC_WakeUp_intern.Mode=WakeUp
VP_RTC_VS_RTC_WakeUp_intern.Signal=RTC_VS_RTC_WakeUp_intern
VP_SEQUENCER_VS_SEQUENCER.Mode=SEQUENCER_Enabled
VP_SEQUENCER_VS_SEQUENCER.Signal=SEQUENCER_VS_SEQUENCER
VP_STM32_WPAN_VS_BLE_HOST.Mode=STM32_WPAN_Enabled
VP_STM32_WPAN_VS_BLE_HOST.Signal=STM32_WPAN_VS_BLE_HOST
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TINY_LPM_VS_TINY_LPM.Mode=TINY_LPM_Enabled
VP_TINY_LPM_VS_TINY_LPM.Signal=TINY_LPM_VS_TINY_LPM
VP_WWDG_VS_WWDG.Mode=WWDG_Activate
VP_WWDG_VS_WWDG.Signal=WWDG_VS_WWDG
WWDG.EWIMode=WWDG_EWI_ENABLE
WWDG.IPParameters=EWIMode
board=custom
